predicates/index.tex
% Created 2025-03-06 Thu 18:38
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8x]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{parskip}
\setcounter{secnumdepth}{3}
\author{Raghav B. Venkataramaiyer}
\date{Feb '25}
\title{Practice Predicates\\\medskip
\large Language, Representation and Interpretationg}
\hypersetup{
 pdfauthor={Raghav B. Venkataramaiyer},
 pdftitle={Practice Predicates},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.24)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Predicate No. \texttt{290e}}
\label{sec:orged1c636}

\paragraph*{Well Formed Expression}
\label{sec:orgdfd00d1}

\(\forall X (\text{student?}(X) \rightarrow \exists Y (\text{book?}(Y) \land \text{has\_read?}(X, Y)))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org1a972e2}

Every student has read some book.



\section{Predicate No. \texttt{d9e2}}
\label{sec:org31a50e7}

\paragraph*{Well Formed Expression}
\label{sec:orgff0fbef}

\(\forall \mathit{Feature} (\exists \mathit{Library} (\mathrm{depends\_on?}(\mathit{Feature}, \mathit{Library})) \rightarrow (\neg \mathrm{compatible\_with?}(\mathit{Feature}, \mathit{Library}) \land \mathrm{deprecated?}(\mathit{Library})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org73843f9}

Every feature depends upon some incompatible and deprecated library.



\section{Predicate No. \texttt{4f1g}}
\label{sec:org0c237bc}

\paragraph*{Well Formed Expression}
\label{sec:orga5eb087}

\(\exists \mathit{TranscriptionFactor} \exists \mathit{ActivatorProtein} \forall \mathit{TargetGene} ((\mathrm{transcription\_factor?}(\mathit{TranscriptionFactor}) \rightarrow \mathrm{activates?}(\mathit{ActivatorProtein}, \mathit{TargetGene})) \land \neg \mathrm{co\_located?}(\mathit{TranscriptionFactor}, \mathit{TargetGene}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org0bf9ba1}

A protein may activate all genes that aren't co-located with a specific transcription factor.



\section{Predicate No. \texttt{3d4e}}
\label{sec:org54f978f}

\paragraph*{Well Formed Expression}
\label{sec:org9f6d3fb}

\(\exists \mathit{Fluid} \exists \mathit{Pipe} (\neg \mathrm{incompressible?}(\mathit{Fluid}) \land \mathrm{flows\_through?}(\mathit{Fluid}, \mathit{Pipe}) \rightarrow \mathrm{pressure\_drop?}(\mathit{Pipe}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org4e66cb5}

If a compressible fluid flows through a pipe, then the pipe experiences pressure drop.



\section{Predicate No. \texttt{9i0j}}
\label{sec:org0579ced}

\paragraph*{Well Formed Expression}
\label{sec:org6fbd884}

\(\exists \mathit{Gene}\ \exists \mathit{Protein}\ \forall \mathit{DNARegion}\ ((\mathrm{inhibits\_proliferation?}(\mathit{Gene}) \,\land\, \mathrm{binds\_to?}(\mathit{Protein}, \mathit{DNARegion})) \rightarrow \neg \mathrm{regulates\_binding?}(\mathit{Gene}, \mathit{Protein}, \mathit{DNARegion}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org724b532}

A gene that stops cell growth and a protein exist where the gene never regulates the protein binding to DNA.



\section{Predicate No. \texttt{6q7r}}
\label{sec:orge2e1314}

\paragraph*{Well Formed Expression}
\label{sec:org9acce60}

\(\forall \mathit{System} \forall \mathit{VibrationDamper} \forall \mathit{StandardComponent} (\mathrm{vibration\_sensitive?}(\mathit{System}) \rightarrow (\mathrm{vibration\_damper?}(\mathit{VibrationDamper}) \land \neg \mathrm{replaced\_by?}(\mathit{StandardComponent}, \mathit{VibrationDamper})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org12775ea}

In a vibration-sensitive system, a vibration damper is used without replacing any standard component.



\section{Predicate No. \texttt{9j0k}}
\label{sec:orgfaaad17}

\paragraph*{Well Formed Expression}
\label{sec:org12b0e73}

\(\exists \mathit{Reactor} \forall \mathit{Condition} (\neg \mathrm{cstr?}(\mathit{Reactor}) \lor (\mathrm{high\_pressure?}(\mathit{Condition}) \rightarrow \mathrm{suitable\_for?}(\mathit{Reactor}, \mathit{Condition})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orga003956}

A reactor exists that either isn't a continuous stirred-tank reactor (CSTR), or is suitable for all high pressure conditions.



\section{Predicate No. \texttt{2e3f}}
\label{sec:org11e5193}

\paragraph*{Well Formed Expression}
\label{sec:org2d22ea2}

\(\forall \mathit{Protein} (\neg \mathrm{membrane\_bound\_receptor?}(\mathit{Protein}) \lor \exists \mathit{Molecule} (\mathrm{interacts\_with?}(\mathit{Protein}, \mathit{Molecule}) \land \neg \mathrm{signaling\_molecule?}(\mathit{Molecule})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org792b0c9}

Every protein is either not a membrane-bound receptor, or it interacts with a molecule that is not a signaling molecule.



\section{Predicate No. \texttt{f3a9}}
\label{sec:orgeffe227}

\paragraph*{Well Formed Expression}
\label{sec:org17b47b3}

\(\forall \mathit{Course} \exists \mathit{Module} (\neg \mathrm{mandatory?}(\mathit{Course}) \lor (\mathrm{advanced?}(\mathit{Module}) \rightarrow \neg \mathrm{requires?}(\mathit{Course}, \mathit{Module})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orgf77ce86}

Either a course is optional, or it doesn't require advanced modules.



\section{Predicate No. \texttt{6d7e}}
\label{sec:org631f489}

\paragraph*{Well Formed Expression}
\label{sec:orgf5c6525}

\(\exists \mathit{GrowthProtein} \forall \mathit{Receptor} (\mathrm{receptor?}(\mathit{Receptor}) \rightarrow (\mathrm{growth\_protein?}(\mathit{GrowthProtein}) \lor \neg \mathrm{inhibits?}(\mathit{GrowthProtein}, \mathit{Receptor})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org86277c6}

A protein involved in cell growth exists that does not inhibit any receptor protein.



\section{Predicate No. \texttt{1b2c}}
\label{sec:org1701969}

\paragraph*{Well Formed Expression}
\label{sec:org4b27f8c}

\(\exists \mathit{Process}\ \forall \mathit{Material}\ (\neg \mathrm{corrosive?}(\mathit{Material}) \land (\mathrm{high\_temperature?}(\mathit{Process}) \rightarrow \mathrm{compatible?}(\mathit{Process}, \mathit{Material})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orgf462edb}

A high-temperature process exists that is compatible with all non-corrosive materials.



\section{Predicate No. \texttt{2b91}}
\label{sec:orge72e6a8}

\paragraph*{Well Formed Expression}
\label{sec:org39c1d3e}

\(\exists \mathit{PortCity} \exists \mathit{ExportCountry} \forall \mathit{DestinationCity} (\mathrm{major\_port?}(\mathit{PortCity}) \land \mathrm{located\_in?}(\mathit{PortCity},\mathit{ExportCountry}) \land \mathrm{exports\_to?}(\mathit{ExportCountry}, \mathit{DestinationCity}) \land \neg \mathrm{located\_in?}(\mathit{DestinationCity},\mathit{ExportCountry}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org4328d33}

A country with a major port may ship to any city outside its borders.



\section{Predicate No. \texttt{1l2m}}
\label{sec:org577950e}

\paragraph*{Well Formed Expression}
\label{sec:orgb827f84}

\(\exists \mathit{Reaction} \forall \mathit{Product} \forall \mathit{Impurity} (\mathrm{high\_yield?}(\mathit{Reaction}) \rightarrow (\neg \mathrm{contains\_impurity?}(\mathit{Product}, \mathit{Impurity}) \land \mathrm{produces?}(\mathit{Reaction}, \mathit{Product})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org568d79b}

Some high-yield reaction produces products that contain no impurities.



\section{Predicate No. \texttt{8h9i}}
\label{sec:org8612a94}

\paragraph*{Well Formed Expression}
\label{sec:org7ab3e7a}

\(\forall \mathit{Protein} \exists \mathit{NLS} (\neg \mathrm{nuclear\_protein?}(\mathit{Protein}) \lor (\mathrm{nls?}(\mathit{NLS}) \rightarrow \neg \mathrm{contains\_nls?}(\mathit{Protein}, \mathit{NLS})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orgfd047ed}

All proteins either aren't nuclear, or they don't have a nuclear signal.



\section{Predicate No. \texttt{8a9b}}
\label{sec:org386d507}

\paragraph*{Well Formed Expression}
\label{sec:org20a7bfb}

\(\exists \mathit{Drug} \exists \mathit{Target} \forall \mathit{Inhibitor} (\mathrm{therapeutic\_effect?}(\mathit{Drug}, \mathit{Target}) \land (\mathrm{known\_inhibitor?}(\mathit{Inhibitor}) \rightarrow \neg \mathrm{inhibited\_by?}(\mathit{Target}, \mathit{Inhibitor})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org680a577}

A drug works with a target that isn't blocked by any known inhibitor.



\section{Predicate No. \texttt{4e5f}}
\label{sec:org9041fe1}

\paragraph*{Well Formed Expression}
\label{sec:orge9caf1a}

\(\forall \mathit{Fluid1} \forall \mathit{Fluid2} (\neg \mathrm{miscible?}(\mathit{Fluid1}, \mathit{Fluid2}) \rightarrow (\mathrm{liquid?}(\mathit{Fluid1}) \lor \mathrm{gas?}(\mathit{Fluid2})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org04597e6}

If two fluids don't mix, then one is a liquid, and the other is a gas.



\section{Predicate No. \texttt{7h8i}}
\label{sec:orgc2419dd}

\paragraph*{Well Formed Expression}
\label{sec:orga522ee1}

\(\exists \mathit{Reaction} \exists \mathit{Inhibitor} (\mathrm{first\_order\_reaction?}(\mathit{Reaction}) \land \neg \mathrm{catalyst?}(\mathit{Inhibitor}) \rightarrow \mathrm{inhibited\_by?}(\mathit{Reaction}, \mathit{Inhibitor}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org1486b05}

Some first-order reaction is inhibited by a non-catalyst compound.



\section{Predicate No. \texttt{d93a}}
\label{sec:org1966a8e}

\paragraph*{Well Formed Expression}
\label{sec:orgd49e7d6}

\(\forall X \exists Y (\neg \text{man?}(X) \lor (\text{word?}(Y) \rightarrow \text{do\_honour?}(X, Y)))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orga7f899a}

Either you are not a man enough or you’d honour your word.



\section{Predicate No. \texttt{b8d3}}
\label{sec:orgd364092}

\paragraph*{Well Formed Expression}
\label{sec:org413f235}

\(\forall X \forall Y (\text{likes?}(X, Y) \rightarrow \exists Z (\text{knows?}(X, Z) \land \text{vouch?}(Z, Y)))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org1085205}

If someone likes another, they know someone who'd vouch for them.



\section{Predicate No. \texttt{2w3x}}
\label{sec:org940bf23}

\paragraph*{Well Formed Expression}
\label{sec:orgd42e902}

\(\forall \mathit{Component} \forall \mathit{Condition} (\mathrm{precision\_machined?}(\mathit{Component}) \land \neg \mathrm{high\_temperature?}(\mathit{Condition}) \rightarrow \mathrm{suitable\_for?}(\mathit{Component}, \mathit{Condition}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orgb821c40}

All precision-machined components are suitable for non-high-temperature operating conditions.



\section{Predicate No. \texttt{5c8d}}
\label{sec:org111121a}

\paragraph*{Well Formed Expression}
\label{sec:org65f04a2}

\(\forall \mathit{Protein} \exists \mathit{Ligand} (\neg \mathrm{signaling\_protein?}(\mathit{Protein}) \lor (\mathrm{ligand?}(\mathit{Ligand}) \rightarrow \mathrm{binds\_to?}(\mathit{Protein}, \mathit{Ligand})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orgc5a8cc7}

Every protein either isn't a signaling protein, or it binds to some ligand.



\section{Predicate No. \texttt{4o5p}}
\label{sec:org9455cbb}

\paragraph*{Well Formed Expression}
\label{sec:orgf06e8d9}

\(\forall \mathit{Material} \forall \mathit{Process} (\mathrm{ductile?}(\mathit{Material}) \land \neg \mathrm{casting\_process?}(\mathit{Process}) \rightarrow \mathrm{suitable\_for?}(\mathit{Material}, \mathit{Process}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org9ce9233}

All ductile materials are suitable for any non-casting manufacturing process.



\section{Predicate No. \texttt{7d6f}}
\label{sec:orgb8d4657}

\paragraph*{Well Formed Expression}
\label{sec:org2a4d02a}

\(\exists \mathit{City} \forall \mathit{Destination} (\mathrm{tourist\_destination?}(\mathit{Destination}) \rightarrow (\mathrm{coastal\_city?}(\mathit{City}) \lor \neg \mathrm{more\_popular?}(\mathit{City}, \mathit{Destination})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orga98d91d}

There is a city that is either a coastal city, or it's less popular than all tourist destinations.



\section{Predicate No. \texttt{c4b2}}
\label{sec:orgbd52b26}

\paragraph*{Well Formed Expression}
\label{sec:orgb2df037}

\(\exists X \forall Y \forall Z (\text{teacher?}(X) \land \text{student\_subject?}(Y, Z) \rightarrow \text{teaches?}(X, Y, Z))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orge468a7a}

There is a teacher who teaches every student every subject.



\section{Predicate No. \texttt{5f6g}}
\label{sec:org7db1216}

\paragraph*{Well Formed Expression}
\label{sec:org34d6667}

\(\exists \mathit{Reaction} \forall \mathit{Product} \forall \mathit{Inhibitor} (\mathrm{produces?}(\mathit{Reaction}, \mathit{Product}) \land \neg \mathrm{inhibited\_by?}(\mathit{Product}, \mathit{Inhibitor}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org6ab1050}

A reaction exists where all products it makes are not inhibited by any inhibitor.



\section{Predicate No. \texttt{2m3n}}
\label{sec:org8fea4b5}

\paragraph*{Well Formed Expression}
\label{sec:org6cfa369}

\(\forall \mathit{Machine} (\neg \mathrm{precision\_instrument?}(\mathit{Machine}) \lor \exists \mathit{Component} (\mathrm{high\_strength\_alloy?}(\mathit{Component}) \land \mathrm{uses?}(\mathit{Machine}, \mathit{Component})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:orgae65d24}

All machines either aren't precision instruments, or they use a high-strength alloy component.



\section{Predicate No. \texttt{1b4c}}
\label{sec:org0d7fe00}

\paragraph*{Well Formed Expression}
\label{sec:orgcbeae4d}

\(\forall \mathit{Restaurant} (\mathrm{popular?}(\mathit{Restaurant}) \rightarrow \exists \mathit{Dish} (\mathrm{vegetarian?}(\mathit{Dish}) \land \mathrm{serves?}(\mathit{Restaurant}, \mathit{Dish})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org376a497}

Every popular restaurant serves at least one vegetarian dish.



\section{Predicate No. \texttt{8s9t}}
\label{sec:org2127cac}

\paragraph*{Well Formed Expression}
\label{sec:org6d7652e}

\(\forall \mathit{Machine} \exists \mathit{Component} (\neg \mathrm{requires\_maintenance?}(\mathit{Machine}, \mathit{Component}) \lor (\mathrm{high\_wear?}(\mathit{Component}) \rightarrow \mathrm{high\_maintenance\_frequency?}(\mathit{Machine})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org8fc6e37}

Every machine either has a component it rarely maintains, or it needs frequent maintenance due to some high-wear component.



\section{Predicate No. \texttt{3n4o}}
\label{sec:org163e697}

\paragraph*{Well Formed Expression}
\label{sec:org335b8c4}

\(\forall \mathit{Component} \exists \mathit{AssemblyStation} \exists \mathit{Tool} (\mathrm{compatible?}(\mathit{Tool}, \mathit{Component}) \land \mathrm{uses\_tool?}(\mathit{AssemblyStation}, \mathit{Tool}, \mathit{Component}))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org2ac608e}

All components are controlled by an assembly station through a compatible tool.



\section{Predicate No. \texttt{0u1v}}
\label{sec:org6f4361b}

\paragraph*{Well Formed Expression}
\label{sec:org68a6d25}

\(\forall \mathit{QualityControlSystem} \exists \mathit{CriticalDefect} \forall \mathit{Sensor} (\mathrm{automated?}(\mathit{QualityControlSystem}) \rightarrow (\mathrm{critical?}(\mathit{CriticalDefect}) \land \neg \mathrm{detects?}(\mathit{Sensor}, \mathit{CriticalDefect})))\)

\paragraph*{Interpretation in Natural Language}
\label{sec:org2c407de}

Automated quality control systems have blind spots for critical defects.
\end{document}
